[
  {
    "id": 1,
    "name": "RVD",
    "championships": [
      {
        "title": "WWE",
        "times": 1
      }
    ],
    "description": "The Whole F'n Show, RVD is a high-flying daredevil with a unique blend of martial arts and aerial maneuvers. Known for his laid-back attitude and innovative moves like the Van Daminator and the Five-Star Frog Splash."
  },
  {
    "id": 2,
    "name": "John Cena",
    "championships": [
      {
        "title": "WWE",
        "times": 17
      }
    ],
    "description": "The Face That Runs the Place, John Cena is a powerhouse with a never-give-up attitude. His signature moves like the Attitude Adjustment and the STF have made him a legend in the ring."
  },
  {
    "id": 3,
    "name": "Chris Jericho",
    "championships": [
      {
        "title": "WWE",
        "times": 6
      },
      {
        "title": "Intercontinental",
        "times": 9
      }
    ],
    "description": "The Ayatollah of Rock 'n' Rolla, Chris Jericho is a master of reinvention. With a blend of technical prowess and showmanship, he's won titles across multiple promotions and is a true icon of the industry."
  },
  {
    "id": 4,
    "name": "Stone Cold Steve Austin",
    "championships": [
      {
        "title": "WWE",
        "times": 6
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The Texas Rattlesnake, Stone Cold Steve Austin is the embodiment of rebellion. With his Stunner and his 'Austin 3:16' catchphrase, he became the face of the Attitude Era and a cultural phenomenon."
  },
  {
    "id": 5,
    "name": "CM Punk",
    "championships": [
      {
        "title": "WWE",
        "times": 5
      },
      {
        "title": "Intercontinental",
        "times": 1
      }
    ],
    "description": "The Voice of the Voiceless, CM Punk is a straight-edge superstar with a gift for gab. His Pipe Bomb promo and his 434-day WWE Championship reign solidified his place in wrestling history."
  },
  {
    "id": 6,
    "name": "The Rock",
    "championships": [
      {
        "title": "WWE",
        "times": 10
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The People's Champion, The Rock is a charismatic powerhouse with a knack for entertainment. His Rock Bottom and People's Elbow, along with his electrifying promos, have made him a global icon."
  },
  {
    "id": 7,
    "name": "Triple H",
    "championships": [
      {
        "title": "WWE",
        "times": 14
      },
      {
        "title": "Intercontinental",
        "times": 5
      }
    ],
    "description": "The Game, Triple H is a cerebral assassin with a pedigree for success. His sledgehammer and his strategic mind have helped him dominate the ring and become a wrestling legend."
  },
  {
    "id": 8,
    "name": "Randy Orton",
    "championships": [
      {
        "title": "WWE",
        "times": 14
      },
      {
        "title": "Intercontinental",
        "times": 1
      }
    ],
    "description": "The Viper, Randy Orton is a third-generation superstar with a lethal RKO. His cunning and ruthless nature have made him one of the most dangerous competitors in wrestling."
  },
  {
    "id": 9,
    "name": "Edge",
    "championships": [
      {
        "title": "WWE",
        "times": 11
      },
      {
        "title": "Intercontinental",
        "times": 5
      }
    ],
    "description": "The Rated-R Superstar, Edge is an opportunistic daredevil with a penchant for the extreme. His Spear and his TLC matches have cemented his legacy as a hardcore legend."
  },
  {
    "id": 10,
    "name": "Shawn Michaels",
    "championships": [
      {
        "title": "WWE",
        "times": 4
      },
      {
        "title": "Intercontinental",
        "times": 3
      }
    ],
    "description": "The Showstopper, Shawn Michaels is a charismatic performer with unparalleled in-ring skills. His Sweet Chin Music and his Mr. WrestleMania moniker speak to his ability to deliver on the grandest stage."
  },
  {
    "id": 11,
    "name": "Bret Hart",
    "championships": [
      {
        "title": "WWE",
        "times": 5
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The Excellence of Execution, Bret Hart is a technical master with a sharpshooter submission. His storytelling and in-ring psychology have made him one of the greatest of all time."
  },
  {
    "id": 12,
    "name": "Kurt Angle",
    "championships": [
      {
        "title": "WWE",
        "times": 6
      },
      {
        "title": "Intercontinental",
        "times": 1
      }
    ],
    "description": "The Olympic Hero, Kurt Angle is a wrestling machine with a gold medal pedigree. His Ankle Lock and his intensity have made him a force to be reckoned with in the ring."
  },
  {
    "id": 13,
    "name": "Brock Lesnar",
    "championships": [
      {
        "title": "WWE",
        "times": 10
      }
    ],
    "description": "The Beast Incarnate, Brock Lesnar is a powerhouse with a suplex city residency. His F5 and his sheer dominance have made him one of the most feared competitors in wrestling."
  },
  {
    "id": 14,
    "name": "Roman Reigns",
    "championships": [
      {
        "title": "WWE",
        "times": 6
      }
    ],
    "description": "The Tribal Chief, Roman Reigns is a dominant force with a spear that can end any match. His leadership and his ability to perform under pressure have made him a top star."
  },
  {
    "id": 15,
    "name": "Seth Rollins",
    "championships": [
      {
        "title": "WWE",
        "times": 6
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The Architect, Seth Rollins is a visionary with a curb stomp that can change the game. His innovative style and his ability to reinvent himself have made him a standout performer."
  },
  {
    "id": 16,
    "name": "Dean Ambrose",
    "championships": [
      {
        "title": "WWE",
        "times": 1
      },
      {
        "title": "Intercontinental",
        "times": 3
      }
    ],
    "description": "The Lunatic Fringe, Dean Ambrose is an unpredictable wild card with a penchant for chaos. His Dirty Deeds and his fearless attitude have made him a fan favorite."
  },
  {
    "id": 17,
    "name": "The Miz",
    "championships": [
      {
        "title": "WWE",
        "times": 2
      },
      {
        "title": "Intercontinental",
        "times": 8
      }
    ],
    "description": "The A-Lister, The Miz is a charismatic talker with a Skull-Crushing Finale. His ability to entertain and his never-say-die attitude have made him a mainstay in wrestling."
  },
  {
    "id": 18,
    "name": "Dolph Ziggler",
    "championships": [
      {
        "title": "WWE",
        "times": 2
      },
      {
        "title": "Intercontinental",
        "times": 6
      }
    ],
    "description": "The Showoff, Dolph Ziggler is an athletic marvel with a Zig Zag that can come out of nowhere. His resilience and his ability to perform at a high level have earned him respect."
  },
  {
    "id": 19,
    "name": "Jeff Hardy",
    "championships": [
      {
        "title": "WWE",
        "times": 3
      },
      {
        "title": "Intercontinental",
        "times": 5
      }
    ],
    "description": "The Charismatic Enigma, Jeff Hardy is a high-flying artist with a Swanton Bomb that defies gravity. His creativity and his willingness to take risks have made him a legend."
  },
  {
    "id": 20,
    "name": "Big E",
    "championships": [
      {
        "title": "WWE",
        "times": 1
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The Powerhouse of Positivity, Big E is a charismatic strongman with a Big Ending that can flatten opponents. His humor and his strength have made him a fan favorite."
  },
  {
    "id": 21,
    "name": "Gunther",
    "championships": [
      {
        "title": "Intercontinental",
        "times": 1
      }
    ],
    "description": "The Ring General, Gunther is a hard-hitting technician with a devastating chop. His dominance and his ability to control the ring have made him a force to be reckoned with."
  },
  {
    "id": 22,
    "name": "Kevin Owens",
    "championships": [
      {
        "title": "WWE",
        "times": 3
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The Prizefighter, Kevin Owens is a brawling trash-talker with a Stunner that can end any match. His tenacity and his ability to get under his opponents' skin have made him a standout."
  },
  {
    "id": 23,
    "name": "Finn Balor",
    "championships": [
      {
        "title": "WWE",
        "times": 1
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The Demon King, Finn Balor is a versatile performer with a Coup de Grâce that can finish any opponent. His ability to transform into the demon has added a unique element to his character."
  },
  {
    "id": 24,
    "name": "AJ Styles",
    "championships": [
      {
        "title": "WWE",
        "times": 2
      }
    ],
    "description": "The Phenomenal One, AJ Styles is a wrestling virtuoso with a Styles Clash that can win any match. His ability to adapt and his consistent excellence have made him a legend."
  },
  {
    "id": 25,
    "name": "Cody Rhodes",
    "championships": [
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The American Nightmare, Cody Rhodes is a passionate performer with a Cross Rhodes that can end any match. His dedication to the craft and his ability to tell a story have made him a fan favorite."
  },
  {
    "id": 26,
    "name": "Rey Mysterio",
    "championships": [
      {
        "title": "WWE",
        "times": 3
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The Ultimate Underdog, Rey Mysterio is a high-flying luchador with a 619 that can surprise any opponent. His heart and his ability to overcome the odds have made him a legend."
  },
  {
    "id": 27,
    "name": "JBL",
    "championships": [
      {
        "title": "WWE",
        "times": 1
      },
      {
        "title": "Intercontinental",
        "times": 1
      }
    ],
    "description": "The Wrestling God, JBL is a hard-hitting Texan with a Clothesline from Hell. His business acumen and his in-ring brutality have made him a memorable character."
  },
  {
    "id": 28,
    "name": "Eddie Guerrero",
    "championships": [
      {
        "title": "WWE",
        "times": 1
      },
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "Latino Heat, Eddie Guerrero is a charismatic technician with a Frog Splash that honors his legacy. His ability to lie, cheat, and steal his way to victory made him a beloved figure."
  },
  {
    "id": 29,
    "name": "Booker T",
    "championships": [
      {
        "title": "WWE",
        "times": 1
      },
      {
        "title": "Intercontinental",
        "times": 1
      }
    ],
    "description": "The Five-Time WCW Champion, Booker T is an athletic entertainer with a Scissor Kick that can cut through the competition. His charisma and his in-ring skills have made him a fan favorite."
  },
  {
    "id": 30,
    "name": "Shinsuke Nakamura",
    "championships": [
      {
        "title": "Intercontinental",
        "times": 2
      }
    ],
    "description": "The King of Strong Style, Shinsuke Nakamura is a charismatic striker with a Kinshasa that can end any match. His unorthodox style and his ability to captivate the audience have made him a standout."
  },
  {
    "id": 31,
    "name": "The Undertaker",
    "championships": [
      {
        "title": "WWE",
        "times": 4
      }
    ],
    "description": "The Phenom, The Undertaker is a legendary figure with a supernatural aura. His Tombstone Piledriver and his undefeated streak at WrestleMania have made him an icon of the industry."
  },
  {
    "id": 32,
    "name": "Ric Flair",
    "championships": [
      {
        "title": "WWE",
        "times": 2
      }
    ],
    "description": "The Nature Boy, Ric Flair is a flamboyant stylist with a Figure-Four Leglock that has submitted many opponents. His 'Woo!' catchphrase and his incredible career spanning decades have made him a wrestling icon."
  },
  {
    "id": 33,
    "name": "Daniel Bryan",
    "championships": [
      {
        "title": "WWE",
        "times": 4
      }
    ],
    "description": "The Yes Man, Daniel Bryan is a technical wizard with a Running Knee that can knock out any opponent. His underdog story and his 'Yes!' movement have made him a beloved figure in wrestling."
  }
]